In [1]:
import pandas as pd

In [3]:
from pandas import DataFrame

# Series

In [6]:
ser1 = pd.Series([1, 2, 3, 4], index = ['USA', 'Germany', 'USSR', 'Japan'])

In [7]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [8]:
ser2 = pd.Series([1, 2, 5, 4], index = ['USA', 'Germany', 'Italy', 'Japan'])

In [9]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [10]:
pd.__version__

'0.25.1'

In [11]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [13]:
a = [1, 2, 3, 4, 5]
b = [x for x in range(10)]

a + b

[1, 2, 3, 4, 5, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [14]:
ser3  = ser1 + ser2
ser3.fillna(3, inplace = True)
ser3

Germany    4.0
Italy      3.0
Japan      8.0
USA        2.0
USSR       3.0
dtype: float64

In [15]:
ser3.Italy

3.0

In [16]:
ser3.Italy = 5

In [17]:
ser3

Germany    4.0
Italy      5.0
Japan      8.0
USA        2.0
USSR       3.0
dtype: float64

In [18]:
ser3[1:4]

Italy    5.0
Japan    8.0
USA      2.0
dtype: float64

In [20]:
ser3['USSR'] = 3

In [21]:
ser3

Germany    4.0
Italy      5.0
Japan      8.0
USA        2.0
USSR       3.0
dtype: float64

# DataFrames

In [22]:
a = [x for x in range(10)]
b = [x for x in range(10)]
c = [x for x in range(10)]

In [23]:
ndarray = []

ndarray.append(a)
ndarray.append(b)
ndarray.append(c)
ndarray

[[0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
 [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
 [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]]

In [24]:
for elements in ndarray:
    print('Elements - ', elements)
    for element in elements:
        print('Element - ', element) #итое джитое

Elements -  [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
Element -  0
Element -  1
Element -  2
Element -  3
Element -  4
Element -  5
Element -  6
Element -  7
Element -  8
Element -  9
Elements -  [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
Element -  0
Element -  1
Element -  2
Element -  3
Element -  4
Element -  5
Element -  6
Element -  7
Element -  8
Element -  9
Elements -  [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
Element -  0
Element -  1
Element -  2
Element -  3
Element -  4
Element -  5
Element -  6
Element -  7
Element -  8
Element -  9

# DataFrames

In [25]:
import pandas as pd
import numpy as np

In [37]:
from numpy.random import randn
np.random.seed(101)

In [35]:
'A B C D E'.split()

['A', 'B', 'C', 'D', 'E']

In [65]:
randn(4, 4)

array([[-9.43406403e-01,  4.84751647e-01, -1.16773316e-01,
         1.90175480e+00],
       [ 2.38126959e-01,  1.99665229e+00, -9.93263500e-01,
         1.96799505e-01],
       [-1.13664459e+00,  3.66479606e-04,  1.02598415e+00,
        -1.56597904e-01],
       [-3.15791439e-02,  6.49825833e-01,  2.15484644e+00,
        -6.10258856e-01]])

In [66]:
np.random.randint(1,10)

9

In [67]:
df = pd.DataFrame(randn(4, 4), index = ["Petya", "Kolya", "Masha", "Sasha"], columns = ["A", "B", "C", "D"])

In [68]:
df

              A         B         C         D
Petya  0.050221  1.556790  1.345434  1.501737
Kolya -0.633348 -0.487281 -1.647469  0.543758
Masha -1.210949 -0.365949  0.632181 -0.393214
Sasha -1.826066  1.257824  1.291497 -0.200139

In [47]:
type(df)

pandas.core.frame.DataFrame

In [50]:
df[['A', 'B']]

              A         B
Petya  2.605967  0.683509
Kolya -1.706086 -1.159119
Masha  0.166905  0.184502
Sasha  0.638787  0.329646

In [77]:
df['new'] = df["A"] + df["B"]
df['new2'] = [1, 2, 3, 4]
df['new3'] = [None, None, None, None]
df['new4'] = df['B']*30/100

In [78]:
df

              A         B         D  new2  new3      new4       new
Petya  0.050221  1.556790  1.501737     1  None  0.467037  1.607011
Kolya -0.633348 -0.487281  0.543758     2  None -0.146184 -1.120630
Masha -1.210949 -0.365949 -0.393214     3  None -0.109785 -1.576898
Sasha -1.826066  1.257824 -0.200139     4  None  0.377347 -0.568242

In [73]:
df.drop('C', axis = 1, inplace = True)

In [79]:
df.drop('new', axis = 1, inplace = True)

In [80]:
df

              A         B         D  new2  new3      new4
Petya  0.050221  1.556790  1.501737     1  None  0.467037
Kolya -0.633348 -0.487281  0.543758     2  None -0.146184
Masha -1.210949 -0.365949 -0.393214     3  None -0.109785
Sasha -1.826066  1.257824 -0.200139     4  None  0.377347

In [57]:
df.loc[['Petya'], ['C']]

              C
Petya  0.302665

In [59]:
a = [1, 2, 3, 4, 5, 6 ,7 , 8, 9, 10]
a[5:-1]

[6, 7, 8, 9]

In [60]:
df

              A         C         D       new  new2  new3 new4
Petya  2.605967  0.302665  1.693723  3.289476     1  None
Kolya -1.706086 -0.134841  0.390528 -2.865205     2  None
Masha  0.166905  0.807706  0.072960  0.351406     3  None
Sasha  0.638787 -0.497104 -0.754070  0.968433     4  None

In [64]:
df.iloc[1:, -3:-1]

       new2  new3
Kolya     2  None
Masha     3  None
Sasha     4  None

In [82]:
df['new4'] = df['A'] + df['B']

In [83]:
df

              A         B         D  new2  new3      new4
Petya  0.050221  1.556790  1.501737     1  None  1.607011
Kolya -0.633348 -0.487281  0.543758     2  None -1.120630
Masha -1.210949 -0.365949 -0.393214     3  None -1.576898
Sasha -1.826066  1.257824 -0.200139     4  None -0.568242